<?php
namespace Wechat\Lib;

use Prpcrypt;
use Wechat\Loader;

/**
 * 微信SDK基础类
 *
 * @category WechatSDK
 * @subpackage library
 * @author Anyon <zoujingli@qq.com>
 *         @date 2016/05/28 11:55
 */
class Common
{

    /**
     * API接口URL需要使用此前缀
     */
    const API_BASE_URL_PREFIX = 'https://api.weixin.qq.com';

    const API_URL_PREFIX = 'https://api.weixin.qq.com/cgi-bin';

    const GET_TICKET_URL = '/ticket/getticket?';

    const AUTH_URL = '/token?grant_type=client_credential&';

    public $token;

    public $encodingAesKey;

    public $encrypt_type;

    public $appid;

    public $appsecret;

    public $access_token;

    public $postxml;

    public $_msg;

    public $errCode = 0;

    public $errMsg = "no access";

    public $config = array();

    private $_retry = FALSE;

    /**
     * 构造方法
     * 
     * @param array $options            
     */
    public function __construct($options = array())
    {
        $config = Loader::config($options);
        $this->token = isset($config['token']) ? $config['token'] : '';
        $this->appid = isset($config['appid']) ? $config['appid'] : '';
        $this->appsecret = isset($config['appsecret']) ? $config['appsecret'] : '';
        $this->encodingAesKey = isset($config['encodingaeskey']) ? $config['encodingaeskey'] : '';
        $this->config = $config;
    }

    /**
     * 接口验证
     * 
     * @return bool
     */
    public function valid()
    {
        $encryptStr = "";
        if ($_SERVER['REQUEST_METHOD'] == "POST") {
            $postStr = file_get_contents("php://input");
            $array = (array) simplexml_load_string($postStr, 'SimpleXMLElement', LIBXML_NOCDATA);
            $this->encrypt_type = isset($_GET["encrypt_type"]) ? $_GET["encrypt_type"] : '';
            if ($this->encrypt_type == 'aes') {
                $encryptStr = $array['Encrypt'];
                ! class_exists('Prpcrypt', FALSE) && require __DIR__ . '/Prpcrypt.php';
                $pc = new Prpcrypt($this->encodingAesKey);
                $array = $pc->decrypt($encryptStr, $this->appid);
                if (! isset($array[0]) || intval($array[0]) > 0) {
                    $this->errCode = $array[0];
                    $this->errMsg = $array[1];
                    Tools::log("Interface Authentication Failed. {$this->errMsg}[{$this->errCode}]", 'ERR');
                    return false;
                }
                $this->postxml = $array[1];
                empty($this->appid) && $this->appid = $array[2];
            } else {
                $this->postxml = $postStr;
            }
        } elseif (isset($_GET["echostr"])) {
            if ($this->checkSignature()) {
                exit($_GET["echostr"]);
            } else {
                return false;
            }
        }
        if (! $this->checkSignature($encryptStr)) {
            $this->errMsg = 'Interface authentication failed, please use the correct method to call.';
            return false;
        }
        return true;
    }

    /**
     * 验证来自微信服务器
     * 
     * @param string $str            
     * @return bool
     */
    private function checkSignature($str = '')
    {
        // 如果存在加密验证则用加密验证段
        $signature = isset($_GET["msg_signature"]) ? $_GET["msg_signature"] : (isset($_GET["signature"]) ? $_GET["signature"] : '');
        $timestamp = isset($_GET["timestamp"]) ? $_GET["timestamp"] : '';
        $nonce = isset($_GET["nonce"]) ? $_GET["nonce"] : '';
        $tmpArr = array(
            $this->token,
            $timestamp,
            $nonce,
            $str
        );
        sort($tmpArr, SORT_STRING);
        if (sha1(implode($tmpArr)) == $signature) {
            return true;
        } else {
            return false;
        }
    }

    /**
     * 获取公众号访问 access_token
     * 
     * @param string $appid
     *            如在类初始化时已提供，则可为空
     * @param string $appsecret
     *            如在类初始化时已提供，则可为空
     * @param string $token
     *            手动指定access_token，非必要情况不建议用
     * @return bool|string
     */
    public function getAccessToken($appid = '', $appsecret = '', $token = '')
    {
        if (! $appid || ! $appsecret) {
            $appid = $this->appid;
            $appsecret = $this->appsecret;
        }
        if ($token) {
            return $this->access_token = $token;
        }
        $cache = 'wechat_access_token_' . $appid;
        if (($access_token = Tools::getCache($cache)) && ! empty($access_token)) {
            return $this->access_token = $access_token;
        }
        // 检测事件注册
        if (isset(Loader::$callback[__FUNCTION__])) {
            return $this->access_token = call_user_func_array(Loader::$callback[__FUNCTION__], array(
                &$this,
                &$cache
            ));
        }
        $result = Tools::httpGet(self::API_URL_PREFIX . self::AUTH_URL . 'appid=' . $appid . '&secret=' . $appsecret);
        if ($result) {
            $json = json_decode($result, true);
            if (! $json || isset($json['errcode'])) {
                $this->errCode = $json['errcode'];
                $this->errMsg = $json['errmsg'];
                Tools::log("Get New AccessToken Error. {$this->errMsg}[{$this->errCode}]", 'ERR');
                return false;
            }
            $this->access_token = $json['access_token'];
            Tools::log("Get New AccessToken Success.");
            Tools::setCache($cache, $this->access_token, 5000);
            return $this->access_token;
        }
        return false;
    }

    /**
     * 接口失败重试
     * 
     * @param $method SDK方法名称            
     * @param array $arguments
     *            SDK方法参数
     * @return bool|mixed
     */
    protected function checkRetry($method, $arguments = array())
    {
        if (! $this->_retry && in_array($this->errCode, array(
            '40014',
            '40001',
            '41001',
            '42001'
        ))) {
            Tools::log("Run {$method} Faild. {$this->errMsg}[{$this->errCode}]", 'ERR');
            ($this->_retry = true) && $this->resetAuth();
            $this->errCode = 40001;
            $this->errMsg = 'no access';
            Tools::log("Retry Run {$method} ...");
            return call_user_func_array(array(
                $this,
                $method
            ), $arguments);
        }
        return false;
    }

    /**
     * 删除验证数据
     * 
     * @param string $appid
     *            如在类初始化时已提供，则可为空
     * @return bool
     */
    public function resetAuth($appid = '')
    {
        $authname = 'wechat_access_token_' . (empty($appid) ? $this->appid : $appid);
        Tools::log("Reset Auth And Remove Old AccessToken.");
        $this->access_token = '';
        Tools::removeCache($authname);
        return true;
    }

    /**
     * 微信服务号官方错误码
     */
    public function error_list($code = '')
    {
        $list = array(
            '-1' => "系统繁忙，此时请开发者稍候再试",
            '0' => "请求成功",
            '40001' => "获取access_token时AppSecret错误，或者access_token无效。请开发者认真比对AppSecret的正确性，或查看是否正在为恰当的公众号调用接口",
            '40002' => "不合法的凭证类型",
            '40003' => "不合法的OpenID，请开发者确认OpenID（该用户）是否已关注公众号，或是否是其他公众号的OpenID",
            '40004' => "不合法的媒体文件类型",
            '40005' => "不合法的文件类型",
            '40006' => "不合法的文件大小",
            '40007' => "不合法的媒体文件id",
            '40008' => "不合法的消息类型",
            '40009' => "不合法的图片文件大小",
            '40010' => "不合法的语音文件大小",
            '40011' => "不合法的视频文件大小",
            '40012' => "不合法的缩略图文件大小",
            '40013' => "不合法的AppID，请开发者检查AppID的正确性，避免异常字符，注意大小写",
            '40014' => "不合法的access_token，请开发者认真比对access_token的有效性（如是否过期），或查看是否正在为恰当的公众号调用接口",
            '40015' => "不合法的菜单类型",
            '40016' => "不合法的按钮个数",
            '40017' => "不合法的按钮个数",
            '40018' => "不合法的按钮名字长度",
            '40019' => "不合法的按钮KEY长度",
            '40020' => "不合法的按钮URL长度",
            '40021' => "不合法的菜单版本号",
            '40022' => "不合法的子菜单级数",
            '40023' => "不合法的子菜单按钮个数",
            '40024' => "不合法的子菜单按钮类型",
            '40025' => "不合法的子菜单按钮名字长度",
            '40026' => "不合法的子菜单按钮KEY长度",
            '40027' => "不合法的子菜单按钮URL长度",
            '40028' => "不合法的自定义菜单使用用户",
            '40029' => "不合法的oauth_code",
            '40030' => "不合法的refresh_token",
            '40031' => "不合法的openid列表",
            '40032' => "不合法的openid列表长度",
            '40033' => "不合法的请求字符，不能包含\uxxxx格式的字符",
            '40035' => "不合法的参数",
            '40038' => "不合法的请求格式",
            '40039' => "不合法的URL长度",
            '40050' => "不合法的分组id",
            '40051' => "分组名字不合法",
            '40117' => "分组名字不合法",
            '40118' => "media_id大小不合法",
            '40119' => "button类型错误",
            '40120' => "button类型错误",
            '40121' => "不合法的media_id类型",
            '40132' => "微信号不合法",
            '40137' => "不支持的图片格式",
            '40155' => "请勿添加其他公众号的主页链接",
            '41001' => "缺少access_token参数",
            '41002' => "缺少appid参数",
            '41003' => "缺少refresh_token参数",
            '41004' => "缺少secret参数",
            '41005' => "缺少多媒体文件数据",
            '41006' => "缺少media_id参数",
            '41007' => "缺少子菜单数据",
            '41008' => "缺少oauth code",
            '41009' => "缺少openid",
            '42001' => "access_token超时，请检查access_token的有效期，请参考基础支持-获取access_token中，对access_token的详细机制说明",
            '42002' => "refresh_token超时",
            '42003' => "oauth_code超时",
            '42007' => "用户修改微信密码，accesstoken和refreshtoken失效，需要重新授权",
            '43001' => "需要GET请求",
            '43002' => "需要POST请求",
            '43003' => "需要HTTPS请求",
            '43004' => "需要接收者关注",
            '43005' => "需要好友关系",
            '43019' => "需要将接收者从黑名单中移除",
            '44001' => "多媒体文件为空",
            '44002' => "POST的数据包为空",
            '44003' => "图文消息内容为空",
            '44004' => "文本消息内容为空",
            '45001' => "多媒体文件大小超过限制",
            '45002' => "消息内容超过限制",
            '45003' => "标题字段超过限制",
            '45004' => "描述字段超过限制",
            '45005' => "链接字段超过限制",
            '45006' => "图片链接字段超过限制",
            '45007' => "语音播放时间超过限制",
            '45008' => "图文消息超过限制",
            '45009' => "接口调用超过限制",
            '45010' => "创建菜单个数超过限制",
            '45011' => "API调用太频繁，请稍候再试",
            '45015' => "回复时间超过限制",
            '45016' => "系统分组，不允许修改",
            '45017' => "分组名字过长",
            '45018' => "分组数量超过上限",
            '45047' => "客服接口下行条数超过上限",
            '46001' => "不存在媒体数据",
            '46002' => "不存在的菜单版本",
            '46003' => "不存在的菜单数据",
            '46004' => "不存在的用户",
            '47001' => "解析JSON/XML内容错误",
            '48001' => "api功能未授权，请确认公众号已获得该接口，可以在公众平台官网-开发者中心页中查看接口权限",
            '48002' => "粉丝拒收消息（粉丝在公众号选项中，关闭了“接收消息”）",
            '48004' => "api接口被封禁，请登录mp.weixin.qq.com查看详情",
            '48005' => "api禁止删除被自动回复和自定义菜单引用的素材",
            '48006' => "api禁止清零调用次数，因为清零次数达到上限",
            '50001' => "用户未授权该api",
            '50002' => "用户受限，可能是违规后接口被封禁",
            '61451' => "参数错误(invalid parameter)",
            '61452' => "无效客服账号(invalid kf_account)",
            '61453' => "客服帐号已存在(kf_account exsited)",
            '61454' => "客服帐号名长度超过限制(仅允许10个英文字符，不包括@及@后的公众号的微信号)(invalid   kf_acount length)",
            '61455' => "客服帐号名包含非法字符(仅允许英文+数字)(illegal character in     kf_account)",
            '61456' => "客服帐号个数超过限制(10个客服账号)(kf_account count exceeded)",
            '61457' => "无效头像文件类型(invalid   file type)",
            '61450' => "系统错误(system error)",
            '61500' => "日期格式错误",
            '65301' => "不存在此menuid对应的个性化菜单",
            '65302' => "没有相应的用户",
            '65303' => "没有默认菜单，不能创建个性化菜单",
            '65304' => "MatchRule信息为空",
            '65305' => "个性化菜单数量受限",
            '65306' => "不支持个性化菜单的帐号",
            '65307' => "个性化菜单信息为空",
            '65308' => "包含没有响应类型的button",
            '65309' => "个性化菜单开关处于关闭状态",
            '65310' => "填写了省份或城市信息，国家信息不能为空",
            '65311' => "填写了城市信息，省份信息不能为空",
            '65312' => "不合法的国家信息",
            '65313' => "不合法的省份信息",
            '65314' => "不合法的城市信息",
            '65316' => "该公众号的菜单设置了过多的域名外跳（最多跳转到3个域名的链接）",
            '65317' => "不合法的URL",
            '9001001' => "POST数据参数不合法",
            '9001002' => "远端服务不可用",
            '9001003' => "Ticket不合法",
            '9001004' => "获取摇周边用户信息失败",
            '9001005' => "获取商户信息失败",
            '9001006' => "获取OpenID失败",
            '9001007' => "上传文件缺失",
            '9001008' => "上传素材的文件类型不合法",
            '9001009' => "上传素材的文件尺寸不合法",
            '9001010' => "上传失败",
            '9001020' => "帐号不合法",
            '9001021' => "已有设备激活率低于50%，不能新增设备",
            '9001022' => "设备申请数不合法，必须为大于0的数字",
            '9001023' => "已存在审核中的设备ID申请",
            '9001024' => "一次查询设备ID数量不能超过50",
            '9001025' => "设备ID不合法",
            '9001026' => "页面ID不合法",
            '9001027' => "页面参数不合法",
            '9001028' => "一次删除页面ID数量不能超过10",
            '9001029' => "页面已应用在设备中，请先解除应用关系再删除",
            '9001030' => "一次查询页面ID数量不能超过50",
            '9001031' => "时间区间不合法",
            '9001032' => "保存设备与页面的绑定关系参数错误",
            '9001033' => "门店ID不合法",
            '9001034' => "设备备注信息过长",
            '9001035' => "设备申请参数不合法",
            '9001036' => "查询起始值begin不合法"
        );
        return $code ? $list[$code] : $list;
    }

    /**
     * 微信企业号-官方错误码说明
     */
    public function company_error_list($code = '')
    {
        $error_list = array(
            '-1' => "系统繁忙",
            '0' => "请求成功",
            '40001' => "获取access_token时Secret错误，或者access_token无效",
            '40002' => "不合法的凭证类型",
            '40003' => "不合法的UserID",
            '40004' => "不合法的媒体文件类型",
            '40005' => "不合法的文件类型",
            '40006' => "不合法的文件大小",
            '40007' => "不合法的媒体文件id",
            '40008' => "不合法的消息类型",
            '40013' => "不合法的corpid",
            '40014' => "不合法的access_token",
            '40015' => "不合法的菜单类型",
            '40016' => "不合法的按钮个数",
            '40017' => "不合法的按钮类型",
            '40018' => "不合法的按钮名字长度",
            '40019' => "不合法的按钮KEY长度",
            '40020' => "不合法的按钮URL长度",
            '40021' => "不合法的菜单版本号",
            '40022' => "不合法的子菜单级数",
            '40023' => "不合法的子菜单按钮个数",
            '40024' => "不合法的子菜单按钮类型",
            '40025' => "不合法的子菜单按钮名字长度",
            '40026' => "不合法的子菜单按钮KEY长度",
            '40027' => "不合法的子菜单按钮URL长度",
            '40028' => "不合法的自定义菜单使用成员",
            '40029' => "不合法的oauth_code",
            '40031' => "不合法的UserID列表",
            '40032' => "不合法的UserID列表长度",
            '40033' => "不合法的请求字符，不能包含\uxxxx格式的字符",
            '40035' => "不合法的参数",
            '40038' => "不合法的请求格式",
            '40039' => "不合法的URL长度",
            '40040' => "不合法的插件token",
            '40041' => "不合法的插件id",
            '40042' => "不合法的插件会话",
            '40048' => "url中包含不合法domain",
            '40054' => "不合法的子菜单url域名",
            '40055' => "不合法的按钮url域名",
            '40056' => "不合法的agentid",
            '40057' => "不合法的callbackurl或者callbackurl验证失败",
            '40058' => "不合法的红包参数",
            '40059' => "不合法的上报地理位置标志位",
            '40060' => "设置上报地理位置标志位时没有设置callbackurl",
            '40061' => "设置应用头像失败",
            '40062' => "不合法的应用模式",
            '40063' => "参数为空",
            '40064' => "管理组名字已存在",
            '40065' => "不合法的管理组名字长度",
            '40066' => "不合法的部门列表",
            '40067' => "标题长度不合法",
            '40068' => "不合法的标签ID",
            '40069' => "不合法的标签ID列表",
            '40070' => "列表中所有标签（成员）ID都不合法",
            '40071' => "不合法的标签名字，标签名字已经存在",
            '40072' => "不合法的标签名字长度",
            '40073' => "不合法的openid",
            '40074' => "news消息不支持指定为高保密消息",
            '40077' => "不合法的预授权码",
            '40078' => "不合法的临时授权码",
            '40079' => "不合法的授权信息",
            '40080' => "不合法的suitesecret",
            '40082' => "不合法的suitetoken",
            '40083' => "不合法的suiteid",
            '40084' => "不合法的永久授权码",
            '40085' => "不合法的suiteticket",
            '40086' => "不合法的第三方应用appid",
            '40092' => "导入文件存在不合法的内容",
            '40093' => "不合法的跳转target",
            '40094' => "不合法的URL",
            '40095' => "修改失败，并发冲突",
            '40155' => "请勿添加其他公众号的主页链接",
            '41001' => "缺少access_token参数",
            '41002' => "缺少corpid参数",
            '41003' => "缺少refresh_token参数",
            '41004' => "缺少secret参数",
            '41005' => "缺少多媒体文件数据",
            '41006' => "缺少media_id参数",
            '41007' => "缺少子菜单数据",
            '41008' => "缺少oauth code",
            '41009' => "缺少UserID",
            '41010' => "缺少url",
            '41011' => "缺少agentid",
            '41012' => "缺少应用头像mediaid",
            '41013' => "缺少应用名字",
            '41014' => "缺少应用描述",
            '41015' => "缺少Content",
            '41016' => "缺少标题",
            '41017' => "缺少标签ID",
            '41018' => "缺少标签名字",
            '41021' => "缺少suiteid",
            '41022' => "缺少suitetoken",
            '41023' => "缺少suiteticket",
            '41024' => "缺少suitesecret",
            '41025' => "缺少永久授权码",
            '41034' => "缺少login_ticket",
            '41035' => "缺少跳转target",
            '42001' => "access_token过期",
            '42002' => "refresh_token过期",
            '42003' => "oauth_code过期",
            '42004' => "插件token过期",
            '42007' => "预授权码失效",
            '42008' => "临时授权码失效",
            '42009' => "suitetoken失效",
            '43001' => "需要GET请求",
            '43002' => "需要POST请求",
            '43003' => "需要HTTPS",
            '43004' => "需要成员已关注",
            '43005' => "需要好友关系",
            '43006' => "需要订阅",
            '43007' => "需要授权",
            '43008' => "需要支付授权",
            '43010' => "需要处于回调模式",
            '43011' => "需要企业授权",
            '43013' => "应用对成员不可见",
            '44001' => "多媒体文件为空",
            '44002' => "POST的数据包为空",
            '44003' => "图文消息内容为空",
            '44004' => "文本消息内容为空",
            '45001' => "多媒体文件大小超过限制",
            '45002' => "消息内容大小超过限制",
            '45003' => "标题大小超过限制",
            '45004' => "描述大小超过限制",
            '45005' => "链接长度超过限制",
            '45006' => "图片链接长度超过限制",
            '45007' => "语音播放时间超过限制",
            '45008' => "图文消息的文章数量不能超过10条",
            '45009' => "接口调用超过限制",
            '45010' => "创建菜单个数超过限制",
            '45015' => "回复时间超过限制",
            '45016' => "系统分组，不允许修改",
            '45017' => "分组名字过长",
            '45018' => "分组数量超过上限",
            '45022' => "应用名字长度不合法，合法长度为2-16个字",
            '45024' => "帐号数量超过上限",
            '45025' => "同一个成员每周只能邀请一次",
            '45026' => "触发删除用户数的保护",
            '45027' => "mpnews每天只能发送100次",
            '45028' => "素材数量超过上限",
            '45029' => "media_id对该应用不可见",
            '45032' => "作者名字长度超过限制",
            '46001' => "不存在媒体数据",
            '46002' => "不存在的菜单版本",
            '46003' => "不存在的菜单数据",
            '46004' => "不存在的成员",
            '47001' => "解析JSON/XML内容错误",
            '48001' => "Api未授权",
            '48002' => "Api禁用(一般是管理组类型与Api不匹配，例如普通管理组调用会话服务的Api)",
            '48003' => "suitetoken无效",
            '48004' => "授权关系无效",
            '48005' => "Api已废弃",
            '50001' => "redirect_uri未授权",
            '50002' => "成员不在权限范围",
            '50003' => "应用已停用",
            '50004' => "成员状态不正确，需要成员为企业验证中状态",
            '50005' => "企业已禁用",
            '60001' => "部门长度不符合限制",
            '60002' => "部门层级深度超过限制",
            '60003' => "部门不存在",
            '60004' => "父亲部门不存在",
            '60005' => "不允许删除有成员的部门",
            '60006' => "不允许删除有子部门的部门",
            '60007' => "不允许删除根部门",
            '60008' => "部门ID或者部门名称已存在",
            '60009' => "部门名称含有非法字符",
            '60010' => "部门存在循环关系",
            '60011' => "管理组权限不足，（user/department/agent）无权限",
            '60012' => "不允许删除默认应用",
            '60013' => "不允许关闭应用",
            '60014' => "不允许开启应用",
            '60015' => "不允许修改默认应用可见范围",
            '60016' => "不允许删除存在成员的标签",
            '60017' => "不允许设置企业",
            '60019' => "不允许设置应用地理位置上报开关",
            '60020' => "访问ip不在白名单之中",
            '60023' => "已授权的应用不允许企业管理组调用接口修改菜单",
            '60025' => "主页型应用不支持的消息类型",
            '60027' => "不支持第三方修改主页型应用字段",
            '60028' => "应用已授权予第三方，不允许通过接口修改主页url",
            '60029' => "应用已授权予第三方，不允许通过接口修改可信域名",
            '60031' => "未设置管理组的登录授权域名",
            '60102' => "UserID已存在",
            '60103' => "手机号码不合法",
            '60104' => "手机号码已存在",
            '60105' => "邮箱不合法",
            '60106' => "邮箱已存在",
            '60107' => "微信号不合法",
            '60108' => "微信号已存在",
            '60109' => "QQ号已存在",
            '60110' => "用户同时归属部门超过20个",
            '60111' => "UserID不存在",
            '60112' => "成员姓名不合法",
            '60113' => "身份认证信息（微信号/手机/邮箱）不能同时为空",
            '60114' => "性别不合法",
            '60115' => "已关注成员微信不能修改",
            '60116' => "扩展属性已存在",
            '60118' => "成员无有效邀请字段，详情参考(邀请成员关注)的接口说明",
            '60119' => "成员已关注",
            '60120' => "成员已禁用",
            '60121' => "找不到该成员",
            '60122' => "邮箱已被外部管理员使用",
            '60123' => "无效的部门id",
            '60124' => "无效的父部门id",
            '60125' => "非法部门名字，长度超过限制、重名等，重名包括与csv文件中同级部门重名或者与旧组织架构包含成员的同级部门重名",
            '60126' => "创建部门失败",
            '60127' => "缺少部门id",
            '60128' => "字段不合法，可能存在主键冲突或者格式错误",
            '60129' => "用户设置了拒绝邀请",
            '60131' => "不合法的职位长度",
            '80001' => "可信域名不匹配，或者可信域名没有IPC备案（后续将不能在该域名下正常使用jssdk）",
            '81003' => "邀请额度已用完",
            '81004' => "部门数量超过上限",
            '82001' => "发送消息或者邀请的参数全部为空或者全部不合法",
            '82002' => "不合法的PartyID列表长度",
            '82003' => "不合法的TagID列表长度",
            '82004' => "微信版本号过低",
            '84013' => "企业会话、客服套件已下线",
            '85002' => "包含不合法的词语",
            '86001' => "不合法的会话ID",
            '86003' => "不存在的会话ID",
            '86004' => "不合法的会话名",
            '86005' => "不合法的会话管理员",
            '86006' => "不合法的成员列表大小",
            '86007' => "不存在的成员",
            '86101' => "需要会话管理员权限",
            '86201' => "缺少会话ID",
            '86202' => "缺少会话名",
            '86203' => "缺少会话管理员",
            '86204' => "缺少成员",
            '86205' => "非法的会话ID长度",
            '86206' => "非法的会话ID数值",
            '86207' => "会话管理员不在用户列表中",
            '86208' => "消息服务未开启",
            '86209' => "缺少操作者",
            '86210' => "缺少会话参数",
            '86211' => "缺少会话类型（单聊或者群聊）",
            '86213' => "缺少发件人",
            '86214' => "非法的会话类型",
            '86215' => "会话已存在",
            '86216' => "非法会话成员",
            '86217' => "会话操作者不在成员列表中",
            '86218' => "非法会话发件人",
            '86219' => "非法会话收件人",
            '86220' => "非法会话操作者",
            '86221' => "单聊模式下，发件人与收件人不能为同一人",
            '86222' => "不允许消息服务访问的API",
            '86304' => "不合法的消息类型",
            '86305' => "客服服务未启用",
            '86306' => "缺少发送人",
            '86307' => "缺少发送人类型",
            '86308' => "缺少发送人id",
            '86309' => "缺少接收人",
            '86310' => "缺少接收人类型",
            '86311' => "缺少接收人id",
            '86312' => "缺少消息类型",
            '86313' => "缺少客服，发送人或接收人类型，必须有一个为kf",
            '86314' => "客服不唯一，发送人或接收人类型，必须只有一个为kf",
            '86315' => "不合法的发送人类型",
            '86316' => "不合法的发送人id。Userid不存在、openid不存在、kf不存在",
            '86317' => "不合法的接收人类型",
            '86318' => "不合法的接收人id。Userid不存在、openid不存在、kf不存在",
            '86319' => "不合法的客服，kf不在客服列表中",
            '86320' => "不合法的客服类型",
            '88001' => "缺少seq参数",
            '88002' => "缺少offset参数",
            '88003' => "非法seq",
            '90001' => "未认证摇一摇周边",
            '90002' => "缺少摇一摇周边ticket参数",
            '90003' => "摇一摇周边ticket参数不合法",
            '90004' => "摇一摇周边ticket过期",
            '90005' => "未开启摇一摇周边服务",
            '91004' => "卡券已被核销",
            '91011' => "无效的code",
            '91014' => "缺少卡券详情",
            '91015' => "代金券缺少least_cost或者reduce_cost参数",
            '91016' => "折扣券缺少discount参数",
            '91017' => "礼品券缺少gift参数",
            '91019' => "缺少卡券sku参数",
            '91020' => "缺少卡券有效期",
            '91021' => "缺少卡券有效期类型",
            '91022' => "缺少卡券logo_url",
            '91023' => "缺少卡券code类型",
            '91025' => "缺少卡券title",
            '91026' => "缺少卡券color",
            '91027' => "缺少offset参数",
            '91028' => "缺少count参数",
            '91029' => "缺少card_id",
            '91030' => "缺少卡券code",
            '91031' => "缺少卡券notice",
            '91032' => "缺少卡券description",
            '91033' => "缺少ticket类型",
            '91036' => "不合法的有效期",
            '91038' => "变更库存值不合法",
            '91039' => "不合法的卡券id",
            '91040' => "不合法的ticket type",
            '91041' => "没有创建，上传卡券logo，以及核销卡券的权限",
            '91042' => "没有该卡券投放权限",
            '91043' => "没有修改或者删除该卡券的权限",
            '91044' => "不合法的卡券参数",
            '91045' => "缺少团购券groupon结构",
            '91046' => "缺少现金券cash结构",
            '91047' => "缺少折扣券discount 结构",
            '91048' => "缺少礼品券gift结构",
            '91049' => "缺少优惠券coupon结构",
            '91050' => "缺少卡券必填字段",
            '91051' => "商户名称超过12个汉字",
            '91052' => "卡券标题超过9个汉字",
            '91053' => "卡券提醒超过16个汉字",
            '91054' => "卡券描述超过1024个汉字",
            '91055' => "卡券副标题长度超过18个汉字",
            '91058' => "未开通卡券服务，不允许调用卡券接口"
        );
        return $code ? $error_list[$code] : $list;
    }

    /**
     * 获取错误提示信息
     */
    public function get_error()
    {
        $str = '错误码:' . $this->errCode;
        $str .= '错误提示:' . $this->errMsg;
        $str .= '错误提示信息:' . $this->error_list($this->errCode);
        return $str;
    }
}
